devanagari={'𑒁': 'अ', '𑒂': 'आ', '𑒃': 'इ', '𑒄': 'ई', '𑒅': 'उ', '𑒆': 'ऊ', '𑒇': 'ऋ', '𑒈': 'ॠ', '𑒉': 'ऌ', '𑒊': 'ॡ', '𑒋': 'ए', '𑒌': 'ऐ', '𑒍': 'ओ', '𑒎': 'औ', '𑒰': 'ा', '𑒱': 'ि', '𑒲': 'ी', '𑒳': 'ु', '𑒴': 'ू', '𑒵': 'ृ', '𑒶': 'ॄ', '𑒷': 'ॢ', '𑒸': 'ॣ', '𑒹': 'े', '𑒻': 'ै', '𑒼': 'ो', '𑒾': 'ौ', '𑒺': 'ॆ', '𑒽': 'ॊ', '𑓀': 'ं', '𑒿': 'ँ', '𑓁': 'ः', '𑓂': '्', '𑓃': '़', '𑓄': 'ऽ', '𑓇': 'ॐ', '𑒏': 'क', '𑒐': 'ख', '𑒑': 'ग', '𑒒': 'घ', '𑒓': 'ङ', '𑒔': 'च', '𑒕': 'छ', '𑒖': 'ज', '𑒗': 'झ', '𑒘': 'ञ', '𑒙': 'ट', '𑒚': 'ठ', '𑒛': 'ड', '𑒜': 'ढ', '𑒝': 'ण', '𑒞': 'त', '𑒟': 'थ', '𑒠': 'द', '𑒡': 'ध', '𑒢': 'न', '𑒣': 'प', '𑒤': 'फ', '𑒥': 'ब', '𑒦': 'भ', '𑒧': 'म', '𑒨': 'य', '𑒩': 'र', '𑒪': 'ल', '𑒫': 'व', '𑒬': 'श', '𑒭': 'ष', '𑒮': 'स', '𑒯': 'ह', '𑓐': '0', '𑓑': '1', '𑓒': '2', '𑓓': '3', '𑓔': '4', '𑓕': '5', '𑓖': '6', '𑓗': '7', '𑓘': '8', '𑓙': '9'}
dev_txt=''
for i in input("Enter text in Mithilakshara script : "):
    if i in devanagari:
        dev_txt+=str(devanagari[i])
    else:
        dev_txt+=str(i)

print(dev_txt)

